<?php  if ( ! defined('BASEPATH')) exit('No direct script access allowed');

define('MAP_RADIUS', 10); // 10km圏内
define('LOCATION_LIMIT', 30);

// 文字数
define('CAMPAIGN_LENGTH', 25);
define('CAMPAIGN_BODY_LENGTH', 150);
define('COUPON_LENGTH', 150);
define('JOB_LENGTH', 300);

// オプション設定
$config['option'] = array(
	array('id' => 'op_all', 'price' => 4800,	'name' => 'フルオプションパック', 'body' => '<p>下記オプションすべてに登録する事で割引価格となります。</p>'),
	array('id' => 'op1', 'price' => 3500,	'name' => 'キャンペーン概要', 'body' => '<p>'.CAMPAIGN_LENGTH . '文字以内でキャンペーン概要を公開できます。<br />キャンペーン概要を登録するとマップ上にキャンペーン情報が表示され、<br />ショップ一覧表示時に登録していないショップ様より上位に表示されます。</p>'),
	array('id' => 'op2', 'price' => 850,	'name' => 'キャンペーン内容', 'body' => '<p>'.CAMPAIGN_BODY_LENGTH . '文字以内でキャンペーン内容を公開できます。</p>'),
	array('id' => 'op3', 'price' => 850,	'name' => 'クーポン機能', 'body' => '<p>'.COUPON_LENGTH . '文字以内でクーポン情報を公開できます。</p>'),
	array('id' => 'op4', 'price' => 500,	'name' => 'メールマガジン', 'body' => '<p>希望の購読者にメールマガジンを配信できます。</p>'),
	array('id' => 'op5', 'price' => 300,	'name' => 'チラシ・ＰＯＰリンク', 'body' => '<p>チラシやPOPの画像やPDFを公開できます。</p>'),
	array('id' => 'op6', 'price' => 300,	'name' => '求人情報', 'body' => '<p>'.JOB_LENGTH . '文字以内で求人情報を公開できます。</p>'),
	array('id' => 'op7', 'price' => 300,	'name' => 'レビュー(ON/OFF機能付き)', 'body' => '<p>レビューを表示ON/OFFを選択できます。</p>'),
	array('id' => 'op8', 'price' => 300,	'name' => '写真・動画', 'body' => '<p>写真やYoutube動画を公開できます。</p>'),
);


// ON OFF
$config['on_off'] = array(
	2 => 'オフ',
	1 => 'オン'
);

// レビュー
$config['review'] = array(
	1 => '表示',
	0 => '非表示'
);

// レビュー評価
$config['score'] = array(
	5 => '大変満足',
	4 => '満足',
	3 => '普通',
	2 => 'やや不満',
	1 => '不満',
);

// 駐車場
$config['parking'] = array(
	0 => '無',
	1 => '有(無料)',
	2 => '有(有料)'
);

// バリアフリー
$config['barrier_free'] = array(
	0 => '未対応',
	1 => '対応'
);

$config['yes_no'] = array(
	0 => '－',
	1 => '○'
);

// 携帯販売タイプ
$config['carrier'] = array(
	'd' => 'ドコモ',
	'a' => 'au',
	's' => 'ソフトバンク',
	'w' => 'ウィルコム',
	'e' => 'イーモバイル',
	'h' => '併売店',
	'k' => '家電量販店',
	't' => '中古携帯',
	'p' => 'スーパー'
);

$config['prefecture'] = array(
	//'' => '都道府県を選択',
	'01' => '北海道',
	'02' => '青森県',
	'03' => '岩手県',
	'04' => '宮城県',
	'05' => '秋田県',
	'06' => '山形県',
	'07' => '福島県',
	'08' => '茨城県',
	'09' => '栃木県',
	'10' => '群馬県',
	'11' => '埼玉県',
	'12' => '千葉県',
	'13' => '東京都',
	'14' => '神奈川県',
	'15' => '新潟県',
	'16' => '富山県',
	'17' => '石川県',
	'18' => '福井県',
	'19' => '山梨県',
	'20' => '長野県',
	'21' => '岐阜県',
	'22' => '静岡県',
	'23' => '愛知県',
	'24' => '三重県',
	'25' => '滋賀県',
	'26' => '京都府',
	'27' => '大阪府',
	'28' => '兵庫県',
	'29' => '奈良県',
	'30' => '和歌山県',
	'31' => '鳥取県',
	'32' => '島根県',
	'33' => '岡山県',
	'34' => '広島県',
	'35' => '山口県',
	'36' => '徳島県',
	'37' => '香川県',
	'38' => '愛媛県',
	'39' => '高知県',
	'40' => '福岡県',
	'41' => '佐賀県',
	'42' => '長崎県',
	'43' => '熊本県',
	'44' => '大分県',
	'45' => '宮崎県',
	'46' => '鹿児島県',
	'47' => '沖縄県'
);
